# Pyber Challenge

### 4.3 Loading and Reading CSV files

In [44]:
# Add Matplotlib inline magic command
%matplotlib inline
# Dependencies and Setup
import matplotlib.pyplot as plt
import pandas as pd

# File to Load (Remember to change these)
city_data_to_load = "Resources/city_data.csv"
ride_data_to_load = "Resources/ride_data.csv"

# Read the City and Ride Data
city_data_df = pd.read_csv(city_data_to_load)
ride_data_df = pd.read_csv(ride_data_to_load)

### Merge the DataFrames

In [45]:
# Combine the data into a single dataset
pyber_data_df = pd.merge(ride_data_df, city_data_df, how="left", on=["city", "city"])

# Display the data table for preview
pyber_data_df.head()

,city,date,fare,ride_id,driver_count,type
0,Lake Jonathanshire,1/14/2019 10:14,13.83,5.739410e+12,5,Urban
1,South Michelleport,3/4/2019 18:24,30.24,2.343910e+12,72,Urban
2,Port Samanthamouth,2/24/2019 4:29,33.44,2.005070e+12,57,Urban
3,Rodneyfort,2/10/2019 23:22,23.44,5.149250e+12,34,Urban
4,South Jack,3/6/2019 4:28,34.58,3.908450e+12,46,Urban

## Deliverable 1: Get a Summary DataFrame

In [46]:
#  1. Get the total rides for each city 
totalridesbytype=pyber_data_df.groupby(["type"]).count()["ride_id"]
totalridesbytype

type
Rural        125
Suburban     625
Urban       1625
Name: ride_id, dtype: int64

In [47]:
# 2. Get the total drivers for each city type
totaldriversbycitytype=city_data_df.groupby(["type"]).sum()["driver_count"]
totaldriversbycitytype

type
Rural         78
Suburban     490
Urban       2405
Name: driver_count, dtype: int64

In [48]:
#  3. Get the total amount of fares for each city type
totalamountfaresbycitytype=pyber_data_df.groupby(["type"]).sum()["fare"]
totalamountfaresbycitytype

type
Rural        4327.93
Suburban    19356.33
Urban       39854.38
Name: fare, dtype: float64

In [49]:
#  4. Get the averag fare per ride for each city type. 
averagefarebycitytype=totalamountfaresbycitytype/totalridesbytype
averagefarebycitytype

type
Rural       34.623440
Suburban    30.970128
Urban       24.525772
dtype: float64

In [50]:
# 5. Get the average fare per driver for each city type. 
averagefarebydriverforcitytype=totalamountfaresbycitytype/totaldriversbycitytype
averagefarebydriverforcitytype

type
Rural       55.486282
Suburban    39.502714
Urban       16.571468
dtype: float64

In [51]:
#  6. Create a PyBer summary DataFrame. 
pyber_summary_df=pd.DataFrame({'total_rides':totalridesbytype,'total_drivers':totaldriversbycitytype,'total_fares':totalamountfaresbycitytype,'Average_Fare_Per_Ride':averagefarebycitytype,'Average_Fare_Per_Driver':averagefarebydriverforcitytype})
pyber_summary_df

,total_rides,total_drivers,total_fares,Average_Fare_Per_Ride,Average_Fare_Per_Driver
type,,,,,
Rural,125,78,4327.93,34.623440,55.486282
Suburban,625,490,19356.33,30.970128,39.502714
Urban,1625,2405,39854.38,24.525772,16.571468

In [52]:
#  7. Cleaning up the DataFrame. Delete the index name
pyber_summary_df.index.name = None

In [53]:
#  8. Format the columns.
pyber_summary_df['total_fares']=pyber_summary_df['total_fares'].map('${:,.2f}'.format)
pyber_summary_df['Average_Fare_Per_Ride']=pyber_summary_df['Average_Fare_Per_Ride'].map('${:,.2f}'.format)
pyber_summary_df['Average_Fare_Per_Driver']=pyber_summary_df['Average_Fare_Per_Driver'].map('${:,.2f}'.format)
pyber_summary_df

,total_rides,total_drivers,total_fares,Average_Fare_Per_Ride,Average_Fare_Per_Driver
Rural,125,78,"$4,327.93",$34.62,$55.49
Suburban,625,490,"$19,356.33",$30.97,$39.50
Urban,1625,2405,"$39,854.38",$24.53,$16.57

## Deliverable 2.  Create a multiple line plot that shows the total weekly of the fares for each type of city.

In [54]:
# 1. Read the merged DataFrame
pyber_data_df.head()

,city,date,fare,ride_id,driver_count,type
0,Lake Jonathanshire,1/14/2019 10:14,13.83,5.739410e+12,5,Urban
1,South Michelleport,3/4/2019 18:24,30.24,2.343910e+12,72,Urban
2,Port Samanthamouth,2/24/2019 4:29,33.44,2.005070e+12,57,Urban
3,Rodneyfort,2/10/2019 23:22,23.44,5.149250e+12,34,Urban
4,South Jack,3/6/2019 4:28,34.58,3.908450e+12,46,Urban

In [55]:
# 2. Using groupby() to create a new DataFrame showing the sum of the fares 
#  for each date where the indices are the city type and date.
df=pyber_data_df.groupby(["date","type"])["fare"].sum()
df=pd.DataFrame(df)
type(df)

pandas.core.frame.DataFrame

In [56]:
df.reset_index()

                date      type   fare
0      1/1/2019 0:08     Urban  37.91
1      1/1/2019 0:46  Suburban  47.74
2     1/1/2019 12:32  Suburban  25.56
3     1/1/2019 14:40     Urban   5.42
4     1/1/2019 14:42     Urban  12.31
...              ...       ...    ...
2359   5/8/2019 1:54     Urban  32.69
2360   5/8/2019 2:31     Urban  41.33
2361   5/8/2019 4:20     Urban  21.99
2362   5/8/2019 4:39     Urban  18.45
2363   5/8/2019 7:29     Urban  18.55

[2364 rows x 3 columns]

In [58]:
df.pivot(index="date",columns=["type"])

KeyError: "None of ['date', 'type'] are in the columns"

In [ ]:
# 3. Reset the index on the DataFrame you created in #1. This is needed to use the 'pivot()' function.
# df = df.reset_index()
pyber_data_df.reset_index()

In [ ]:
# 4. Create a pivot table with the 'date' as the index, the columns ='type', and values='fare' 
# to get the total fares for each type of city by the date. 
df=pyber_data_df[["type","fare","date"]]
df=df.set_index(["date"])
df

In [ ]:
# 5. Create a new DataFrame from the pivot table DataFrame using loc on the given dates, '2019-01-01':'2019-04-29'.

In [ ]:
# 6. Set the "date" index to datetime datatype. This is necessary to use the resample() method in Step 8.
# df.index = pd.to_datetime(df.index)

In [ ]:
# 7. Check that the datatype for the index is datetime using df.info()

In [ ]:
# 8. Create a new DataFrame using the "resample()" function by week 'W' and get the sum of the fares for each week.

In [ ]:
# 8. Using the object-oriented interface method, plot the resample DataFrame using the df.plot() function. 

# Import the style from Matplotlib.
from matplotlib import style
# Use the graph style fivethirtyeight.
style.use('fivethirtyeight')